### Importando Bibliotecas

In [1]:
import sqlite3

### Fazendo a conexão

In [2]:
conexao = sqlite3.connect('Banco')
cursor = conexao.cursor()

### 1- Criando a tabela Alunos

In [61]:
cursor.execute('CREATE TABLE alunos (Id INT, Nome VARCHAR(100), Idade INT, Curso VARCHAR (100));')

### 2-  Inserindo Dados na Tabela

In [62]:
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(1,"Renata","17","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(2,"Carlos","18","Engenharia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(3,"Bruna","20","Logistica")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(4,"Roberto","30","Biologia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(5,"Uriel","24","Engenharia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(6,"Juliana","23","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(7,"Claudia","25","Logistica")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(8,"Jaqueline","18","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(9,"Beatriz","24","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(10,"Luciana","20","Engenharia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(11,"Juliano","23","Logistica")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(12,"Adriel","18","Engenharia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(13,"Gustavo","19","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(14,"Eduardo","18","Logistica")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(15,"Ariel","32","Biologia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(16,"Marcos","23","Matemática")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(17,"Jean","17","Engenharia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(18,"Felipe","18","Logistica")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(19,"Raphael","24","Biologia")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(20,"Marcio","20","Engenharia")')

In [63]:
conexao.commit()
conexao.close

### 3- Consultando uma Tabela

#### A - Selecionar todos os registros da tabela "alunos".

In [64]:
dados = cursor.execute('SELECT * FROM alunos')
for alunos  in dados:
    print(alunos)

(1, 'Renata', 17, 'Matemática')
(2, 'Carlos', 18, 'Engenharia')
(3, 'Bruna', 20, 'Logistica')
(4, 'Roberto', 30, 'Biologia')
(5, 'Uriel', 24, 'Engenharia')
(6, 'Juliana', 23, 'Matemática')
(7, 'Claudia', 25, 'Logistica')
(8, 'Jaqueline', 18, 'Matemática')
(9, 'Beatriz', 24, 'Matemática')
(10, 'Luciana', 20, 'Engenharia')
(11, 'Juliano', 23, 'Logistica')
(12, 'Adriel', 18, 'Engenharia')
(13, 'Gustavo', 19, 'Matemática')
(14, 'Eduardo', 18, 'Logistica')
(15, 'Ariel', 32, 'Biologia')
(16, 'Marcos', 23, 'Matemática')
(17, 'Jean', 17, 'Engenharia')
(18, 'Felipe', 18, 'Logistica')
(19, 'Raphael', 24, 'Biologia')
(20, 'Marcio', 20, 'Engenharia')

#### B - Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [65]:
dados2 = cursor.execute('SELECT Nome, Idade FROM alunos where Idade > 20')
for alunos  in dados2:
    print(alunos)

('Roberto', 30)
('Uriel', 24)
('Juliana', 23)
('Claudia', 25)
('Beatriz', 24)
('Juliano', 23)
('Ariel', 32)
('Marcos', 23)
('Raphael', 24)

#### C - Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [66]:
dados3 = cursor.execute('SELECT * FROM alunos Where Curso = "Engenharia" order by Nome ASC')
for alunos  in dados3:
    print(alunos)

(12, 'Adriel', 18, 'Engenharia')
(2, 'Carlos', 18, 'Engenharia')
(17, 'Jean', 17, 'Engenharia')
(10, 'Luciana', 20, 'Engenharia')
(20, 'Marcio', 20, 'Engenharia')
(5, 'Uriel', 24, 'Engenharia')

#### D - Contar o número total de alunos na tabela

In [67]:
dados4 = cursor.execute('SELECT count(*) FROM alunos')
for alunos  in dados4:
    print(alunos)

(20,)

### 4- Atualização e remoção de dados

#### a - Atualize a idade de um aluno específico na tabela.

In [68]:
cursor.execute('UPDATE alunos SET Idade = 20 Where Id = 17')

In [69]:
dados = cursor.execute('SELECT * FROM alunos WHERE Id = 17')
for alunos  in dados:
    print(alunos)

(17, 'Jean', 20, 'Engenharia')

#### b - Remova um aluno pelo seu ID.

In [70]:
cursor.execute('DELETE FROM alunos WHERE Id = 15')

In [71]:
dados = cursor.execute('SELECT * FROM alunos')
for alunos  in dados:
    print(alunos)

(1, 'Renata', 17, 'Matemática')
(2, 'Carlos', 18, 'Engenharia')
(3, 'Bruna', 20, 'Logistica')
(4, 'Roberto', 30, 'Biologia')
(5, 'Uriel', 24, 'Engenharia')
(6, 'Juliana', 23, 'Matemática')
(7, 'Claudia', 25, 'Logistica')
(8, 'Jaqueline', 18, 'Matemática')
(9, 'Beatriz', 24, 'Matemática')
(10, 'Luciana', 20, 'Engenharia')
(11, 'Juliano', 23, 'Logistica')
(12, 'Adriel', 18, 'Engenharia')
(13, 'Gustavo', 19, 'Matemática')
(14, 'Eduardo', 18, 'Logistica')
(16, 'Marcos', 23, 'Matemática')
(17, 'Jean', 20, 'Engenharia')
(18, 'Felipe', 18, 'Logistica')
(19, 'Raphael', 24, 'Biologia')
(20, 'Marcio', 20, 'Engenharia')

### 5- Criando a tabela  e Inserindo Dados na Tabela

In [72]:
cursor.execute('CREATE TABLE Clientes(id INT, nome VARCHAR(100), idade INT, saldo FLOAT);')

cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(1,"Fabio",35,20000.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(2,"Julia",38,-5000.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(3,"Bruna",35,1125.80)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(4,"Ricardo",23,456.25)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(5,"Macella",42,-200.52)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(6,"Marcus",56,10652.89)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(7,"João",45,2548.57)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(8,"Joana",26,-854.23)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(9,"Fernanda",35,2164.40)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(10,"Maria",38,-5445.21)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(11,"Jean",35,565.87)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(12,"Raphaela",23,894.45)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(13,"Sophia",42,-25.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(14,"Ezio",41,542.51)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(15,"Diego",32,5614.85)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(16,"Dete",75,-26.80)')

conexao.commit()
conexao.close

### 6- Consultas e Funções Agregadas

In [73]:
dados = cursor.execute('SELECT * FROM Clientes')
for Clientes  in dados:
    print(Clientes)

(1, 'Fabio', 35, 20000.0)
(2, 'Julia', 38, -5000.0)
(3, 'Bruna', 35, 1125.8)
(4, 'Ricardo', 23, 456.25)
(5, 'Macella', 42, -200.52)
(6, 'Marcus', 56, 10652.89)
(7, 'João', 45, 2548.57)
(8, 'Joana', 26, -854.23)
(9, 'Fernanda', 35, 2164.4)
(10, 'Maria', 38, -5445.21)
(11, 'Jean', 35, 565.87)
(12, 'Raphaela', 23, 894.45)
(13, 'Sophia', 42, -25.0)
(14, 'Ezio', 41, 542.51)
(15, 'Diego', 32, 5614.85)
(16, 'Dete', 75, -26.8)

#### a - Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [74]:
dados = cursor.execute('SELECT Nome, Idade FROM Clientes where Idade > 30')
for Clientes  in dados:
    print(Clientes)

('Fabio', 35)
('Julia', 38)
('Bruna', 35)
('Macella', 42)
('Marcus', 56)
('João', 45)
('Fernanda', 35)
('Maria', 38)
('Jean', 35)
('Sophia', 42)
('Ezio', 41)
('Diego', 32)
('Dete', 75)

#### b - Calcule o saldo médio dos clientes.

In [77]:
dados = cursor.execute('SELECT round(avg(saldo),2) as saldo_medio FROM Clientes')
for Clientes  in dados:
    print(Clientes)

(2063.36,)

#### c - Encontre o cliente com o saldo máximo.

In [84]:
dados = cursor.execute('SELECT *, max(saldo) as saldo_max FROM Clientes')
for Clientes  in dados:
    print(Clientes)

(1, 'Fabio', 35, 20000.0, 20000.0)

#### d - Conte quantos clientes têm saldo acima de 1000.

In [85]:
dados = cursor.execute('SELECT count(Id) FROM Clientes where saldo > 1000')
for Clientes  in dados:
    print(Clientes)

(6,)

### 7- Atualização e remoção de dados

In [86]:
dados = cursor.execute('SELECT * FROM Clientes')
for Clientes  in dados:
    print(Clientes)

(1, 'Fabio', 35, 20000.0)
(2, 'Julia', 38, -5000.0)
(3, 'Bruna', 35, 1125.8)
(4, 'Ricardo', 23, 456.25)
(5, 'Macella', 42, -200.52)
(6, 'Marcus', 56, 10652.89)
(7, 'João', 45, 2548.57)
(8, 'Joana', 26, -854.23)
(9, 'Fernanda', 35, 2164.4)
(10, 'Maria', 38, -5445.21)
(11, 'Jean', 35, 565.87)
(12, 'Raphaela', 23, 894.45)
(13, 'Sophia', 42, -25.0)
(14, 'Ezio', 41, 542.51)
(15, 'Diego', 32, 5614.85)
(16, 'Dete', 75, -26.8)

#### a - Atualize o saldo de um cliente específico.

In [87]:
cursor.execute('UPDATE Clientes SET saldo = 2054.23 WHERE Id = 10')

In [ ]:
dados = cursor.execute('SELECT * FROM Clientes')
for Clientes  in dados:
    print(Clientes)

#### b - Remova um cliente pelo seu ID.

In [90]:
cursor.execute('DELETE FROM Clientes WHERE Id = 8')

In [91]:
dados = cursor.execute('SELECT * FROM Clientes')
for Clientes  in dados:
    print(Clientes)

(1, 'Fabio', 35, 20000.0)
(2, 'Julia', 38, -5000.0)
(3, 'Bruna', 35, 1125.8)
(4, 'Ricardo', 23, 456.25)
(5, 'Macella', 42, -200.52)
(6, 'Marcus', 56, 10652.89)
(7, 'João', 45, 2548.57)
(9, 'Fernanda', 35, 2164.4)
(10, 'Maria', 38, 2054.23)
(11, 'Jean', 35, 565.87)
(12, 'Raphaela', 23, 894.45)
(13, 'Sophia', 42, -25.0)
(14, 'Ezio', 41, 542.51)
(15, 'Diego', 32, 5614.85)
(16, 'Dete', 75, -26.8)

### 8- Junção de Tabelas

In [ ]:
cursor.execute('CREATE TABLE compras(id INT, cliente_id , nome VARCHAR(100), idade INT, saldo FLOAT);')
cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real)

cursor.execute('INSERT INTO compras(id, nome, idade, saldo) VALUES(1,"Fabio",35,20000.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(2,"Julia",38,-5000.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(3,"Bruna",35,1125.80)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(4,"Ricardo",23,456.25)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(5,"Macella",42,-200.52)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(6,"Marcus",56,10652.89)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(7,"João",45,2548.57)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(8,"Joana",26,-854.23)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(9,"Fernanda",35,2164.40)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(10,"Maria",38,-5445.21)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(11,"Jean",35,565.87)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(12,"Raphaela",23,894.45)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(13,"Sophia",42,-25.00)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(14,"Ezio",41,542.51)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(15,"Diego",32,5614.85)')
cursor.execute('INSERT INTO Clientes(id, nome, idade, saldo) VALUES(16,"Dete",75,-26.80)')

conexao.commit()
conexao.close